# Brewfile - Dev OS tool declarations
# Run: brew bundle install --file=Brewfile

# Dotfiles management
brew "chezmoi"

# Shell tools
brew "starship"
brew "zoxide"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "direnv"
brew "jq"

# Terminal
cask "ghostty"

# Window management
cask "aerospace"

# Session management
brew "tmux"

# Infrastructure (used in later phases)
brew "opentofu"
brew "ansible"

# Secrets
cask "1password-cli"

# Knowledge
cask "obsidian"

# Development
brew "node"
brew "python"
brew "git"
brew "gh"
brew "pnpm"
